; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-4-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-1 - location
	p0-6 - location
	p0-7 - location
	p1-2 - location
	p1-3 - location
	p2-0 - location
	p2-9 - location
	p3-7 - location
	p3-8 - location
	p3-9 - location
	p5-4 - location
	p5-9 - location
	p6-4 - location
	p7-0 - location
	p8-1 - location
	p8-5 - location
	p9-1 - location
	)
	(:init
	(at driver1 s9)
	(at driver2 s4)
	(at driver3 s8)
	(at driver4 s4)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s7)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at package1 s3)
	(at package2 s7)
	(at package3 s8)
	(at package4 s5)
	(at package5 s0)
	(at package6 s3)
	(at package7 s9)
	(at package8 s9)
	(at package9 s1)
	(at package10 s1)
	(at package11 s8)
	(at package12 s0)
	(at package13 s9)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 49)
	(= (time-to-walk p0-1 s0) 49)
	(= (time-to-walk s1 p0-1) 41)
	(= (time-to-walk p0-1 s1) 41)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 36)
	(= (time-to-walk p0-6 s0) 36)
	(= (time-to-walk s6 p0-6) 24)
	(= (time-to-walk p0-6 s6) 24)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(= (time-to-walk s0 p0-7) 43)
	(= (time-to-walk p0-7 s0) 43)
	(= (time-to-walk s7 p0-7) 96)
	(= (time-to-walk p0-7 s7) 96)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 62)
	(= (time-to-walk p1-2 s1) 62)
	(= (time-to-walk s2 p1-2) 82)
	(= (time-to-walk p1-2 s2) 82)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 98)
	(= (time-to-walk p1-3 s1) 98)
	(= (time-to-walk s3 p1-3) 87)
	(= (time-to-walk p1-3 s3) 87)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 78)
	(= (time-to-walk p2-0 s2) 78)
	(= (time-to-walk s0 p2-0) 45)
	(= (time-to-walk p2-0 s0) 45)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(= (time-to-walk s2 p2-9) 71)
	(= (time-to-walk p2-9 s2) 71)
	(= (time-to-walk s9 p2-9) 77)
	(= (time-to-walk p2-9 s9) 77)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 40)
	(= (time-to-walk p3-7 s3) 40)
	(= (time-to-walk s7 p3-7) 8)
	(= (time-to-walk p3-7 s7) 8)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(= (time-to-walk s3 p3-8) 92)
	(= (time-to-walk p3-8 s3) 92)
	(= (time-to-walk s8 p3-8) 7)
	(= (time-to-walk p3-8 s8) 7)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(= (time-to-walk s3 p3-9) 37)
	(= (time-to-walk p3-9 s3) 37)
	(= (time-to-walk s9 p3-9) 7)
	(= (time-to-walk p3-9 s9) 7)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 99)
	(= (time-to-walk p5-4 s5) 99)
	(= (time-to-walk s4 p5-4) 54)
	(= (time-to-walk p5-4 s4) 54)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(= (time-to-walk s5 p5-9) 96)
	(= (time-to-walk p5-9 s5) 96)
	(= (time-to-walk s9 p5-9) 24)
	(= (time-to-walk p5-9 s9) 24)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 50)
	(= (time-to-walk p6-4 s6) 50)
	(= (time-to-walk s4 p6-4) 3)
	(= (time-to-walk p6-4 s4) 3)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(= (time-to-walk s8 p8-1) 21)
	(= (time-to-walk p8-1 s8) 21)
	(= (time-to-walk s1 p8-1) 84)
	(= (time-to-walk p8-1 s1) 84)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(= (time-to-walk s8 p8-5) 1)
	(= (time-to-walk p8-5 s8) 1)
	(= (time-to-walk s5 p8-5) 3)
	(= (time-to-walk p8-5 s5) 3)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(= (time-to-walk s9 p9-1) 47)
	(= (time-to-walk p9-1 s9) 47)
	(= (time-to-walk s1 p9-1) 49)
	(= (time-to-walk p9-1 s1) 49)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 44)
	(= (time-to-drive s2 s0) 44)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 82)
	(= (time-to-drive s4 s0) 82)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 73)
	(= (time-to-drive s9 s0) 73)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 86)
	(= (time-to-drive s0 s1) 86)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 77)
	(= (time-to-drive s8 s1) 77)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 34)
	(= (time-to-drive s6 s2) 34)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 68)
	(= (time-to-drive s8 s2) 68)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 74)
	(= (time-to-drive s2 s3) 74)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 21)
	(= (time-to-drive s4 s3) 21)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 45)
	(= (time-to-drive s5 s3) 45)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 19)
	(= (time-to-drive s8 s3) 19)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 91)
	(= (time-to-drive s1 s4) 91)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 22)
	(= (time-to-drive s6 s4) 22)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 59)
	(= (time-to-drive s7 s4) 59)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 99)
	(= (time-to-drive s0 s5) 99)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 13)
	(= (time-to-drive s2 s5) 13)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 65)
	(= (time-to-drive s4 s5) 65)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 35)
	(= (time-to-drive s8 s5) 35)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 20)
	(= (time-to-drive s9 s5) 20)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 63)
	(= (time-to-drive s9 s6) 63)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 88)
	(= (time-to-drive s0 s7) 88)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 15)
	(= (time-to-drive s3 s7) 15)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 86)
	(= (time-to-drive s5 s7) 86)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 38)
	(= (time-to-drive s6 s8) 38)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 17)
	(= (time-to-drive s2 s9) 17)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 7)
	(= (time-to-drive s4 s9) 7)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 21)
	(= (time-to-drive s7 s9) 21)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s6)
	(at driver2 s2)
	(at driver3 s6)
	(at driver4 s8)
	(at truck3 s9)
	(at truck4 s8)
	(at package1 s7)
	(at package2 s3)
	(at package3 s2)
	(at package4 s7)
	(at package5 s6)
	(at package6 s0)
	(at package7 s4)
	(at package8 s9)
	(at package9 s6)
	(at package10 s9)
	(at package11 s2)
	(at package12 s9)
	(at package13 s8)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver4 truck1 s4)
   deleted: (at driver4 s4) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 1 of 19
2. (drive-truck truck1 s4 s0 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 0 to 82
   goals met: 1 of 19
3. (load-truck package5 truck1 s0)
   deleted: (at package5 s0)
   added: (in package5 truck1)
   goals met: 1 of 19
4. (load-truck package12 truck1 s0)
   deleted: (at package12 s0)
   added: (in package12 truck1)
   goals met: 1 of 19
5. (drive-truck truck1 s0 s2 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 82 to 126
   goals met: 1 of 19
6. (walk driver2 s4 p6-4)
   deleted: (at driver2 s4)
   added: (at driver2 p6-4)
   changed: (walked) from 0 to 3
   goals met: 1 of 19
7. (drive-truck truck1 s2 s5 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (driven) from 126 to 139
   goals met: 1 of 19
8. (load-truck package4 truck1 s5)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   goals met: 1 of 19
9. (drive-truck truck1 s5 s2 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   changed: (driven) from 139 to 152
   goals met: 1 of 19
10. (walk driver2 p6-4 s6)
   deleted: (at driver2 p6-4)
   added: (at driver2 s6)
   changed: (walked) from 3 to 53
   goals met: 1 of 19
11. (drive-truck truck1 s2 s6 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (driven) from 152 to 186
   goals met: 1 of 19
12. (unload-truck package5 truck1 s6)
   deleted: (in package5 truck1)
   added: (at package5 s6)
   goals met: 2 of 19
13. (walk driver1 s9 p2-9)
   deleted: (at driver1 s9)
   added: (at driver1 p2-9)
   changed: (walked) from 53 to 130
   goals met: 2 of 19
14. (drive-truck truck1 s6 s8 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s8)
   changed: (driven) from 186 to 224
   goals met: 2 of 19
15. (load-truck package3 truck1 s8)
   deleted: (at package3 s8)
   added: (in package3 truck1)
   goals met: 2 of 19
16. (load-truck package11 truck1 s8)
   deleted: (at package11 s8)
   added: (in package11 truck1)
   goals met: 2 of 19
17. (walk driver1 p2-9 s2)
   deleted: (at driver1 p2-9)
   added: (at driver1 s2)
   changed: (walked) from 130 to 201
   goals met: 2 of 19
18. (drive-truck truck1 s8 s2 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s2)
   changed: (driven) from 224 to 292
   goals met: 2 of 19
19. (unload-truck package3 truck1 s2)
   deleted: (in package3 truck1)
   added: (at package3 s2)
   goals met: 3 of 19
20. (unload-truck package11 truck1 s2)
   deleted: (in package11 truck1)
   added: (at package11 s2)
   goals met: 4 of 19
21. (drive-truck truck1 s2 s8 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   changed: (driven) from 292 to 360
   goals met: 4 of 19
22. (drive-truck truck1 s8 s1 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s1)
   changed: (driven) from 360 to 437
   goals met: 4 of 19
23. (board-truck driver1 truck4 s2)
   deleted: (at driver1 s2) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 4 of 19
24. (load-truck package9 truck1 s1)
   deleted: (at package9 s1)
   added: (in package9 truck1)
   goals met: 4 of 19
25. (load-truck package10 truck1 s1)
   deleted: (at package10 s1)
   added: (in package10 truck1)
   goals met: 4 of 19
26. (drive-truck truck4 s2 s6 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s6)
   changed: (driven) from 437 to 471
   goals met: 4 of 19
27. (drive-truck truck1 s1 s4 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (driven) from 471 to 562
   goals met: 4 of 19
28. (disembark-truck driver1 truck4 s6)
   deleted: (driving driver1 truck4)
   added: (at driver1 s6) (empty truck4)
   goals met: 5 of 19
29. (board-truck driver2 truck4 s6)
   deleted: (at driver2 s6) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 5 of 19
30. (drive-truck truck1 s4 s7 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   changed: (driven) from 562 to 621
   goals met: 5 of 19
31. (unload-truck package4 truck1 s7)
   deleted: (in package4 truck1)
   added: (at package4 s7)
   goals met: 6 of 19
32. (load-truck package2 truck1 s7)
   deleted: (at package2 s7)
   added: (in package2 truck1)
   goals met: 6 of 19
33. (drive-truck truck1 s7 s5 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   changed: (driven) from 621 to 707
   goals met: 6 of 19
34. (drive-truck truck4 s6 s2 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s2)
   changed: (driven) from 707 to 741
   goals met: 6 of 19
35. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 7 of 19
36. (drive-truck truck1 s5 s3 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 741 to 786
   goals met: 7 of 19
37. (unload-truck package2 truck1 s3)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   goals met: 8 of 19
38. (load-truck package1 truck1 s3)
   deleted: (at package1 s3)
   added: (in package1 truck1)
   goals met: 8 of 19
39. (load-truck package6 truck1 s3)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   goals met: 8 of 19
40. (drive-truck truck1 s3 s2 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (driven) from 786 to 860
   goals met: 8 of 19
41. (drive-truck truck1 s2 s6 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (driven) from 860 to 894
   goals met: 8 of 19
42. (unload-truck package9 truck1 s6)
   deleted: (in package9 truck1)
   added: (at package9 s6)
   goals met: 9 of 19
43. (drive-truck truck1 s6 s9 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s9)
   changed: (driven) from 894 to 957
   goals met: 9 of 19
44. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 8 of 19
45. (unload-truck package10 truck1 s9)
   deleted: (in package10 truck1)
   added: (at package10 s9)
   goals met: 9 of 19
46. (unload-truck package12 truck1 s9)
   deleted: (in package12 truck1)
   added: (at package12 s9)
   goals met: 10 of 19
47. (load-truck package7 truck1 s9)
   deleted: (at package7 s9)
   added: (in package7 truck1)
   goals met: 10 of 19
48. (load-truck package13 truck1 s9)
   deleted: (at package13 s9)
   added: (in package13 truck1)
   goals met: 10 of 19
49. (drive-truck truck1 s9 s7 driver4)
   deleted: (at truck1 s9)
   added: (at truck1 s7)
   changed: (driven) from 957 to 978
   goals met: 10 of 19
50. (unload-truck package1 truck1 s7)
   deleted: (in package1 truck1)
   added: (at package1 s7)
   goals met: 11 of 19
51. (drive-truck truck1 s7 s4 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   changed: (driven) from 978 to 1037
   goals met: 11 of 19
52. (unload-truck package7 truck1 s4)
   deleted: (in package7 truck1)
   added: (at package7 s4)
   goals met: 12 of 19
53. (drive-truck truck1 s4 s7 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   changed: (driven) from 1037 to 1096
   goals met: 12 of 19
54. (drive-truck truck4 s2 s8 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s8)
   changed: (driven) from 1096 to 1164
   goals met: 13 of 19
55. (drive-truck truck1 s7 s0 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   changed: (driven) from 1164 to 1252
   goals met: 13 of 19
56. (unload-truck package6 truck1 s0)
   deleted: (in package6 truck1)
   added: (at package6 s0)
   goals met: 14 of 19
57. (drive-truck truck1 s0 s7 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   changed: (driven) from 1252 to 1340
   goals met: 14 of 19
58. (drive-truck truck4 s8 s2 driver2)
   deleted: (at truck4 s8)
   added: (at truck4 s2)
   changed: (driven) from 1340 to 1408
   goals met: 13 of 19
59. (disembark-truck driver4 truck1 s7)
   deleted: (driving driver4 truck1)
   added: (at driver4 s7) (empty truck1)
   goals met: 13 of 19
60. (board-truck driver4 truck3 s7)
   deleted: (at driver4 s7) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 13 of 19
61. (unload-truck package13 truck1 s7)
   deleted: (in package13 truck1)
   added: (at package13 s7)
   goals met: 13 of 19
62. (load-truck package13 truck3 s7)
   deleted: (at package13 s7)
   added: (in package13 truck3)
   goals met: 13 of 19
63. (drive-truck truck3 s7 s5 driver4)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (driven) from 1408 to 1494
   goals met: 13 of 19
64. (drive-truck truck3 s5 s8 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s8)
   changed: (driven) from 1494 to 1529
   goals met: 13 of 19
65. (disembark-truck driver4 truck3 s8)
   deleted: (driving driver4 truck3)
   added: (at driver4 s8) (empty truck3)
   goals met: 14 of 19
66. (board-truck driver3 truck3 s8)
   deleted: (at driver3 s8) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 14 of 19
67. (drive-truck truck3 s8 s6 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   changed: (driven) from 1529 to 1567
   goals met: 14 of 19
68. (drive-truck truck3 s6 s9 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s9)
   changed: (driven) from 1567 to 1630
   goals met: 15 of 19
69. (drive-truck truck4 s2 s9 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s9)
   changed: (driven) from 1630 to 1647
   goals met: 15 of 19
70. (drive-truck truck3 s9 s6 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s6)
   changed: (driven) from 1647 to 1710
   goals met: 14 of 19
71. (drive-truck truck3 s6 s8 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s8)
   changed: (driven) from 1710 to 1748
   goals met: 14 of 19
72. (unload-truck package13 truck3 s8)
   deleted: (in package13 truck3)
   added: (at package13 s8)
   goals met: 15 of 19
73. (drive-truck truck3 s8 s5 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s5)
   changed: (driven) from 1748 to 1783
   goals met: 15 of 19
74. (drive-truck truck4 s9 s2 driver2)
   deleted: (at truck4 s9)
   added: (at truck4 s2)
   changed: (driven) from 1783 to 1800
   goals met: 15 of 19
75. (disembark-truck driver3 truck3 s5)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 15 of 19
76. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 16 of 19
77. (walk driver3 s5 p5-4)
   deleted: (at driver3 s5)
   added: (at driver3 p5-4)
   changed: (walked) from 201 to 300
   goals met: 16 of 19
78. (walk driver3 p5-4 s4)
   deleted: (at driver3 p5-4)
   added: (at driver3 s4)
   changed: (walked) from 300 to 354
   goals met: 16 of 19
79. (walk driver3 s4 p6-4)
   deleted: (at driver3 s4)
   added: (at driver3 p6-4)
   changed: (walked) from 354 to 357
   goals met: 16 of 19
80. (walk driver3 p6-4 s6)
   deleted: (at driver3 p6-4)
   added: (at driver3 s6)
   changed: (walked) from 357 to 407
   goals met: 17 of 19
81. (walk driver4 s8 p8-5)
   deleted: (at driver4 s8)
   added: (at driver4 p8-5)
   changed: (walked) from 407 to 408
   goals met: 16 of 19
82. (walk driver4 p8-5 s5)
   deleted: (at driver4 p8-5)
   added: (at driver4 s5)
   changed: (walked) from 408 to 411
   goals met: 16 of 19
83. (board-truck driver4 truck3 s5)
   deleted: (at driver4 s5) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 16 of 19
84. (drive-truck truck3 s5 s9 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s9)
   changed: (driven) from 1800 to 1820
   goals met: 17 of 19
85. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 16 of 19
86. (disembark-truck driver4 truck3 s9)
   deleted: (driving driver4 truck3)
   added: (at driver4 s9) (empty truck3)
   goals met: 16 of 19
87. (drive-truck truck4 s2 s8 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s8)
   changed: (driven) from 1820 to 1888
   goals met: 17 of 19
88. (walk driver4 s9 p9-1)
   deleted: (at driver4 s9)
   added: (at driver4 p9-1)
   changed: (walked) from 411 to 458
   goals met: 17 of 19
89. (drive-truck truck4 s8 s1 driver2)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   changed: (driven) from 1888 to 1965
   goals met: 16 of 19
90. (walk driver4 p9-1 s1)
   deleted: (at driver4 p9-1)
   added: (at driver4 s1)
   changed: (walked) from 458 to 507
   goals met: 16 of 19
91. (walk driver4 s1 p8-1)
   deleted: (at driver4 s1)
   added: (at driver4 p8-1)
   changed: (walked) from 507 to 591
   goals met: 16 of 19
92. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 16 of 19
93. (walk driver4 p8-1 s8)
   deleted: (at driver4 p8-1)
   added: (at driver4 s8)
   changed: (walked) from 591 to 612
   goals met: 17 of 19
94. (walk driver2 s1 p1-2)
   deleted: (at driver2 s1)
   added: (at driver2 p1-2)
   changed: (walked) from 612 to 674
   goals met: 17 of 19
95. (walk driver2 p1-2 s2)
   deleted: (at driver2 p1-2)
   added: (at driver2 s2)
   changed: (walked) from 674 to 756
   goals met: 18 of 19
96. (walk driver4 s8 p8-1)
   deleted: (at driver4 s8)
   added: (at driver4 p8-1)
   changed: (walked) from 756 to 777
   goals met: 17 of 19
97. (walk driver4 p8-1 s1)
   deleted: (at driver4 p8-1)
   added: (at driver4 s1)
   changed: (walked) from 777 to 861
   goals met: 17 of 19
98. (board-truck driver4 truck4 s1)
   deleted: (at driver4 s1) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 17 of 19
99. (drive-truck truck4 s1 s8 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s8)
   changed: (driven) from 1965 to 2042
   goals met: 18 of 19
100. (disembark-truck driver4 truck4 s8)
   deleted: (driving driver4 truck4)
   added: (at driver4 s8) (empty truck4)
   goals met: 19 of 19
